In [1]:
import pandas as pd
import numpy as np

series = pd.Series([0,2,4,8,6],index=list('12345'),name="ex_series")
series

1    0
2    2
3    4
4    8
5    6
Name: ex_series, dtype: int64

In [2]:
series.name

'ex_series'

In [3]:
series.dtype

dtype('int64')

In [4]:
series.shape

(5,)

In [5]:
series.ndim

1

In [6]:
df = pd.DataFrame([[1,2,3],[4,5,6]])
df

   0  1  2
0  1  2  3
1  4  5  6

In [7]:
df.shape

(2, 3)

In [8]:
df.ndim

2

In [11]:
df.name

AttributeError: 'DataFrame' object has no attribute 'name'

In [12]:
series.size

5

In [13]:
df.size

6

In [14]:
series.index

Index(['1', '2', '3', '4', '5'], dtype='object')

In [15]:
t_sr = pd.Series([5,6,7],index=[1,2,3])
t_sr

1    5
2    6
3    7
dtype: int64

In [17]:
t_sr.index

Int64Index([1, 2, 3], dtype='int64')

In [2]:
series = pd.Series([1,2,3,4,5])
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
s_list = pd.Series([1,2,'가'])
s_list

0    1
1    2
2    가
dtype: object

In [5]:
s_dict = pd.Series({'A': 1, 'B': 2, 'C' : '가'})
s_dict

A    1
B    2
C    가
dtype: object

In [18]:
df = pd.DataFrame([[1,4,7],[2,5,8],[3,6,9]], index=['I1','I2','I3'],columns=['C1','C2','C3'])
df

    C1  C2  C3
I1   1   4   7
I2   2   5   8
I3   3   6   9

In [20]:
df.index

Index(['I1', 'I2', 'I3'], dtype='object')

In [21]:
df.columns

Index(['C1', 'C2', 'C3'], dtype='object')

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, I1 to I3
Data columns (total 3 columns):
C1    3 non-null int64
C2    3 non-null int64
C3    3 non-null int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [17]:
s = set([i for i in dir(pd.Series) if not i.startswith("_")])

In [18]:
d = set([i for i in dir(pd.DataFrame) if not i.startswith("_")])

In [19]:
count = 0
for i in (s - d):
    count += 1
    print(i, end=", ")
    if(count % 4 == 0):
        print()

factorize, compress, asobject, array,
flags, nonzero, is_monotonic_increasing, to_list,
imag, strides, argmax, tolist,
value_counts, to_frame, item, ravel,
divmod, unique, base, argmin,
view, repeat, from_array, cat,
argsort, ptp, name, is_monotonic,
dt, map, dtype, searchsorted,
data, autocorr, str, itemsize,
rdivmod, valid, is_monotonic_decreasing, put,
hasnans, between, is_unique, real,
ftype, nbytes,

In [20]:
count = 0
for i in (d - s):
    count += 1
    print(i, end=", ")
    if(count % 4 == 0):
        print()

to_records, melt, boxplot, join,
insert, iterrows, from_dict, assign,
columns, applymap, select_dtypes, style,
lookup, to_stata, set_index, to_gbq,
to_html, itertuples, to_parquet, merge,
pivot_table, stack, from_items, query,
eval, from_records, info, pivot,
to_feather, corrwith,

In [22]:
count = 0
for i in (d & s):
    count += 1
    print(i, end=", ")
    if(count % 4 == 0):
        print()

rdiv, cumprod, take, kurtosis,
apply, mod, to_json, values,
isnull, floordiv, nlargest, nsmallest,
unstack, is_copy, T, cov,
cummin, rename_axis, between_time, rmod,
swaplevel, at_time, set_axis, drop,
add_prefix, rename, tz_convert, interpolate,
to_csv, to_period, reorder_levels, droplevel,
combine_first, isna, prod, fillna,
axes, pop, truncate, to_pickle,
sum, to_string, to_dict, le,
notna, var, swapaxes, min,
empty, mode, get_dtype_counts, pow,
keys, sem, to_msgpack, iloc,
compound, tail, groupby, idxmax,
ftypes, pipe, xs, truediv,
add, rfloordiv, cummax, shape,
div, squeeze, quantile, reindex,
as_blocks, bool, bfill, ne,
infer_objects, agg, first, aggregate,
reindex_like, corr, dropna, lt,
sub, expanding, append, any,
to_xarray, mul, ndim, duplicated,
equals, radd, combine, sample,
gt, dot, align, ge,
get, last_valid_index, set_value, iteritems,
isin, transform, rtruediv, hist,
head, mad, loc, tshift,
sort_values, kurt, multiply, ewm,
clip, index, size, to_excel,
copy, last, tz_localize, update,
rmul, get_values, median, plot,
clip_upper, blocks, at, reset_index,
to_dense, items, replace, as_matrix,
sparse, pct_change, notnull, resample,
first_valid_index, rpow, slice_shift, to_timestamp,
rank, where, add_suffix, to_latex,
eq, explode, all, mask,
ix, memory_usage, cumsum, to_sql,
subtract, skew, max, asfreq,
filter, round, product, astype,
ffill, rolling, shift, dtypes,
count, mean, to_hdf, describe,
iat, drop_duplicates, std, to_sparse,
abs, transpose, to_numpy, diff,
divide, idxmin, sort_index, get_value,
get_ftype_counts, nunique, to_clipboard, rsub,
asof, clip_lower,

In [25]:
df_f = pd.read_csv('../Pandas/validation.csv'
                   ,usecols=['home_team','away_team'] ,encoding='utf-8')

In [26]:
df_f.head()

               home_team          away_team
0                Chelsea            Arsenal
1       AFC Bournemouth        Cardiff City
2                Fulham      Crystal Palace
3  Huddersfield Town AFC            Chelsea
4      Newcastle United   Tottenham Hotspur

In [28]:
df_f.shape

(19, 2)

In [29]:
df_f['home_team'].head()

0                  Chelsea
1         AFC Bournemouth
2                  Fulham
3    Huddersfield Town AFC
4        Newcastle United
Name: home_team, dtype: object

In [30]:
df_f['home_team'].isnull().sum()

0

In [31]:
df_f['away_team'].isnull().sum()

0

In [32]:
(df_f['home_team'] == df_f['away_team']).head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [27]:
li_st = pd.Series([1,2,3,4,5])
li_st

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [32]:
li_st.values

array([1, 2, 3, 4, 5])

In [33]:
li_st.index

RangeIndex(start=0, stop=5, step=1)

In [34]:
li_st.dtype

dtype('int64')

In [36]:
di_ct = pd.Series({'A' : 0, 'B' : 2, 'C' : 4, 'D' : 6, 'E' : 8}, name='even')
di_ct

A    0
B    2
C    4
D    6
E    8
Name: even, dtype: int64

In [44]:
import numpy as np

# 난수(소수)
n_array = pd.Series(np.random.randn(5))
n_array

0    0.619687
1    0.103898
2   -0.229312
3   -0.249747
4    1.723318
dtype: float64

In [46]:
# 난수(정수)
n_array = pd.Series(np.random.randint(10, size=5))
n_array

0    2
1    0
2    6
3    4
4    6
dtype: int64

In [48]:
series = pd.Series([1,2,3,4],name='s1')
series

0    1
1    2
2    3
3    4
Name: s1, dtype: int64

In [59]:
print("series의 모양 : {}  \nseries의 차원 : {}".format(series.shape, series.ndim))

series의 모양 : (4,)
series의 차원 : 1

In [63]:
# 시리즈 요소 확인(넘파이 배열)
series.values

array([1, 2, 3, 4])

In [66]:
series.empty

False

In [67]:
df_li = pd.DataFrame([[1,2,3,4],[5,6,7,8]])
df_li

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [74]:
df_dict = pd.DataFrame({'A' : {'a' : 1 ,'b' : 2, 'c' : 3}, 'B' : {'a' : 4, 'b' : 5, 'c' : 6},
                        'C' : {'a' : 7, 'b' : 8, 'c' : 9}})
df_dict

   A  B  C
a  1  4  7
b  2  5  8
c  3  6  9

In [75]:
df_dict = pd.DataFrame({'A' : {'a' : 1 ,'b' : 2, 'c' : 3}, 'B' : {'a' : 4, 'b' : 5, 'c' : 6},
                        'C' : {'a' : 7, 'b' : 8, 'c' : 9}}, columns=['A', 'C'])
df_dict

   A  C
a  1  7
b  2  8
c  3  9

In [79]:
se_1 = pd.Series([2,4,6,8])
se_2 = pd.Series(['e','v','e','n'])

In [80]:
df_sr = pd.DataFrame({'One' : se_1, 'Two' : se_2})
df_sr

   One Two
0    2   e
1    4   v
2    6   e
3    8   n

In [81]:
df_sr['One']

0    2
1    4
2    6
3    8
Name: One, dtype: int64

In [82]:
se_1 == df_sr['One']

0    True
1    True
2    True
3    True
dtype: bool

In [83]:
df_sr2 = pd.DataFrame([se_1,se_2])
df_sr2

   0  1  2  3
0  2  4  6  8
1  e  v  e  n

In [2]:
number = [7, 10, 11]
name = ['Cristiano Ronaldo', 'Leonel Messi', 'Neymar']

D_list = list(zip(number, name))

In [3]:
df = pd.DataFrame(data=D_list, columns=['Number', 'Name'])
df

   Number               Name
0       7  Cristiano Ronaldo
1      10       Leonel Messi
2      11             Neymar

In [4]:
df_f = pd.read_csv('../Pandas/validation.csv'
                   ,usecols=['home_team','away_team'] ,encoding='utf-8')
df_f

                   home_team                 away_team
0                    Chelsea                   Arsenal
1           AFC Bournemouth               Cardiff City
2                    Fulham             Crystal Palace
3      Huddersfield Town AFC                   Chelsea
4          Newcastle United          Tottenham Hotspur
5                   Watford   Brighton and Hove Albion
6    Wolverhampton Wanderers                   Everton
7                    Arsenal           Manchester City
8                  Liverpool           West Ham United
9                Southampton                   Burnley
10              Cardiff City          Newcastle United
11        Manchester United            Leicester City
12                   Everton               Southampton
13            Leicester City   Wolverhampton Wanderers
14        Tottenham Hotspur                     Fulham
15          West Ham United            AFC Bournemouth
16  Brighton and Hove Albion      Manchester United FC
17                   Burnley                Watford FC
18          Manchester City      Huddersfield Town AFC

In [5]:
df_f[['home_team','away_team']][1:5]

               home_team          away_team
1       AFC Bournemouth        Cardiff City
2                Fulham      Crystal Palace
3  Huddersfield Town AFC            Chelsea
4      Newcastle United   Tottenham Hotspur

In [16]:
df_f[['home_team']][2:6]

               home_team
2                Fulham
3  Huddersfield Town AFC
4      Newcastle United
5               Watford

In [6]:
df_f.loc[11, 'away_team']

'Leicester City '

In [21]:
df_f.iloc[11, 1]

'Leicester City '

In [32]:
df_f.drop(['home_team'], 1).head()

           away_team
0            Arsenal
1       Cardiff City
2     Crystal Palace
3            Chelsea
4  Tottenham Hotspur

In [34]:
df_f.drop(2, 0).head()

               home_team                 away_team
0                Chelsea                   Arsenal
1       AFC Bournemouth               Cardiff City
3  Huddersfield Town AFC                   Chelsea
4      Newcastle United          Tottenham Hotspur
5               Watford   Brighton and Hove Albion

In [35]:
df_f.head()

               home_team          away_team
0                Chelsea            Arsenal
1       AFC Bournemouth        Cardiff City
2                Fulham      Crystal Palace
3  Huddersfield Town AFC            Chelsea
4      Newcastle United   Tottenham Hotspur

In [36]:
df_f.tail()

                   home_team              away_team
14        Tottenham Hotspur                  Fulham
15          West Ham United         AFC Bournemouth
16  Brighton and Hove Albion   Manchester United FC
17                   Burnley             Watford FC
18          Manchester City   Huddersfield Town AFC

In [37]:
df_f.shape

(19, 2)

In [38]:
df_f.columns

Index(['home_team', 'away_team'], dtype='object')

In [39]:
tmp = df_f['home_team']
tmp.head()

0                  Chelsea
1         AFC Bournemouth
2                  Fulham
3    Huddersfield Town AFC
4        Newcastle United
Name: home_team, dtype: object

In [40]:
tmp[7]

'Arsenal'

In [41]:
tmp.__getitem__(7)

'Arsenal'

In [44]:
df_f.__getitem__('home_team').head()

0                  Chelsea
1         AFC Bournemouth
2                  Fulham
3    Huddersfield Town AFC
4        Newcastle United
Name: home_team, dtype: object

In [46]:
tmp = df_f[7:12]

In [47]:
tmp

             home_team         away_team
7              Arsenal   Manchester City
8            Liverpool   West Ham United
9          Southampton           Burnley
10        Cardiff City  Newcastle United
11  Manchester United    Leicester City

In [48]:
tmp.shape

(5, 2)

In [49]:
df_f.__getitem__(slice(7,12)).head()

             home_team         away_team
7              Arsenal   Manchester City
8            Liverpool   West Ham United
9          Southampton           Burnley
10        Cardiff City  Newcastle United
11  Manchester United    Leicester City

In [80]:
(df_f['home_team'].str.len() < 10)

0      True
1     False
2      True
3     False
4     False
5      True
6     False
7      True
8      True
9     False
10    False
11    False
12     True
13    False
14    False
15    False
16    False
17     True
18    False
Name: home_team, dtype: bool

In [81]:
((df_f['home_team'].str.len() > 13) & (df_f['away_team'].str.len() < 10))

0     False
1     False
2     False
3      True
4     False
5     False
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14     True
15    False
16    False
17    False
18    False
dtype: bool

In [82]:
df = pd.read_csv('../Pandas/premier_league.csv')
df

,home_team,away_team,home_goals,away_goals,result,season
0,Tottenham Hotspur,Manchester City,0,0,D,2010-2011
1,Aston Villa,West Ham United,3,0,H,2010-2011
2,Blackburn Rovers,Everton,1,0,H,2010-2011
3,Bolton Wanderers,Fulham,0,0,D,2010-2011
4,Sunderland,Birmingham City,2,2,D,2010-2011
...,...,...,...,...,...,...
3663,Liverpool,Southampton,4,0,H,NaN
3664,Newcastle United,Norwich City,0,0,D,NaN
3665,Watford,Everton,2,3,A,NaN
3666,West Ham United,Brighton and Hove Albion,3,3,D,NaN
3667,Manchester United,Wolverhampton Wanderers,0,0,D,NaN

In [83]:
df[['home_team','away_team','result']].head()

           home_team        away_team result
0  Tottenham Hotspur  Manchester City      D
1        Aston Villa  West Ham United      H
2   Blackburn Rovers          Everton      H
3   Bolton Wanderers           Fulham      D
4         Sunderland  Birmingham City      D

In [84]:
df[['home_team','away_team','result']].isnull().sum()

home_team    0
away_team    0
result       0
dtype: int64

In [85]:
tmp = df['result']
tmp

0       D
1       H
2       H
3       D
4       D
       ..
3663    H
3664    D
3665    A
3666    D
3667    D
Name: result, Length: 3668, dtype: object

In [86]:
tmp[[2,4,8]]

2    H
4    D
8    D
Name: result, dtype: object

In [87]:
df.loc[0]

home_team     Tottenham Hotspur
away_team       Manchester City
home_goals                    0
away_goals                    0
result                        D
season                2010-2011
Name: 0, dtype: object

In [88]:
df.loc[0, 'home_team']

'Tottenham Hotspur'

In [90]:
df.loc[:, 'away_team'].tail()

3663                 Southampton
3664                Norwich City
3665                    Everton
3666    Brighton and Hove Albion
3667     Wolverhampton Wanderers
Name: away_team, dtype: object

In [91]:
df.loc[:, ['away_team']].head()

         away_team
0  Manchester City
1  West Ham United
2          Everton
3           Fulham
4  Birmingham City

In [93]:
df.xs(3)

home_team     Bolton Wanderers
away_team               Fulham
home_goals                   0
away_goals                   0
result                       D
season               2010-2011
Name: 3, dtype: object

In [95]:
df.xs('home_team',  1).head()

0    Tottenham Hotspur
1          Aston Villa
2     Blackburn Rovers
3     Bolton Wanderers
4           Sunderland
Name: home_team, dtype: object

In [110]:
df.lookup([0,0],['home_team','result'])

array(['Tottenham Hotspur', 'D'], dtype=object)

In [111]:
df.lookup([4,7],['home_team','result'])

array(['Sunderland', 'H'], dtype=object)

In [112]:
df.iloc[0]

home_team     Tottenham Hotspur
away_team       Manchester City
home_goals                    0
away_goals                    0
result                        D
season                2010-2011
Name: 0, dtype: object

In [113]:
df.iloc[0,0]

'Tottenham Hotspur'

In [114]:
df.iloc[0,[0]]

home_team    Tottenham Hotspur
Name: 0, dtype: object

In [116]:
df.iloc[0, [0,1,2,3]]

home_team     Tottenham Hotspur
away_team       Manchester City
home_goals                    0
away_goals                    0
Name: 0, dtype: object

In [117]:
df.iloc[:6, :4]

           home_team        away_team  home_goals  away_goals
0  Tottenham Hotspur  Manchester City           0           0
1        Aston Villa  West Ham United           3           0
2   Blackburn Rovers          Everton           1           0
3   Bolton Wanderers           Fulham           0           0
4         Sunderland  Birmingham City           2           2
5     Wigan Athletic        Blackpool           0           4

In [119]:
((df['home_team'].str.len() > 13) & (df['away_team'].str.len() < 10)).head()

0    False
1    False
2     True
3     True
4    False
dtype: bool

In [122]:
df.loc[((df['home_team'].str.len() > 13) & (df['away_team'].str.len() < 10)),
       ['home_team','away_team','result']].head()

           home_team  away_team result
2   Blackburn Rovers    Everton      H
3   Bolton Wanderers     Fulham      D
5     Wigan Athletic  Blackpool      A
16    Wigan Athletic    Chelsea      A
19   Manchester City  Liverpool      H

In [124]:
df.set_index('home_team')

,away_team,home_goals,away_goals,result,season
home_team,,,,,
Tottenham Hotspur,Manchester City,0,0,D,2010-2011
Aston Villa,West Ham United,3,0,H,2010-2011
Blackburn Rovers,Everton,1,0,H,2010-2011
Bolton Wanderers,Fulham,0,0,D,2010-2011
Sunderland,Birmingham City,2,2,D,2010-2011
...,...,...,...,...,...
Liverpool,Southampton,4,0,H,NaN
Newcastle United,Norwich City,0,0,D,NaN
Watford,Everton,2,3,A,NaN
West Ham United,Brighton and Hove Albion,3,3,D,NaN
Manchester United,Wolverhampton Wanderers,0,0,D,NaN

In [125]:
tmp = df.set_index('home_team')

In [126]:
tmp.sort_index(inplace=True)

In [127]:
tmp.loc['Arsenal': 'Chelsea']

                          away_team  home_goals  away_goals result     season
home_team
Arsenal    Brighton and Hove Albion           2           0      H  2017-2018
Arsenal           Manchester United           3           0      H  2015-2016
Arsenal           Manchester United           1           0      H  2010-2011
Arsenal                  Stoke City           2           0      H  2015-2016
Arsenal              Crystal Palace           4           1      H  2017-2018
...                             ...         ...         ...    ...        ...
Chelsea              Leicester City           0           0      D  2017-2018
Chelsea           Tottenham Hotspur           0           0      D  2011-2012
Chelsea           Tottenham Hotspur           2           2      D  2015-2016
Chelsea        West Bromwich Albion           2           0      H  2014-2015
Chelsea              Crystal Palace           2           1      H  2017-2018

[753 rows x 5 columns]

In [69]:
premier = pd.read_csv("../Pandas/premier_league.csv", usecols=['home_team','away_team','result'])
premier.head(8)

                 home_team             away_team result
0        Tottenham Hotspur       Manchester City      D
1              Aston Villa       West Ham United      H
2         Blackburn Rovers               Everton      H
3         Bolton Wanderers                Fulham      D
4               Sunderland       Birmingham City      D
5           Wigan Athletic             Blackpool      A
6  Wolverhampton Wanderers            Stoke City      H
7                  Chelsea  West Bromwich Albion      H

In [70]:
premier['count'] = 0
premier.head(8)

                 home_team             away_team result  count
0        Tottenham Hotspur       Manchester City      D      0
1              Aston Villa       West Ham United      H      0
2         Blackburn Rovers               Everton      H      0
3         Bolton Wanderers                Fulham      D      0
4               Sunderland       Birmingham City      D      0
5           Wigan Athletic             Blackpool      A      0
6  Wolverhampton Wanderers            Stoke City      H      0
7                  Chelsea  West Bromwich Albion      H      0

In [6]:
premier_all = pd.read_csv("../Pandas/premier_league.csv")
premier_all.head(8)

,home_team,away_team,home_goals,away_goals,result,season
0,Tottenham Hotspur,Manchester City,0,0,D,2010-2011
1,Aston Villa,West Ham United,3,0,H,2010-2011
2,Blackburn Rovers,Everton,1,0,H,2010-2011
3,Bolton Wanderers,Fulham,0,0,D,2010-2011
4,Sunderland,Birmingham City,2,2,D,2010-2011
5,Wigan Athletic,Blackpool,0,4,A,2010-2011
6,Wolverhampton Wanderers,Stoke City,2,1,H,2010-2011
7,Chelsea,West Bromwich Albion,6,0,H,2010-2011

In [71]:
premier['count'] = (premier_all['home_team'].index + 1)
premier.head(8)

                 home_team             away_team result  count
0        Tottenham Hotspur       Manchester City      D      1
1              Aston Villa       West Ham United      H      2
2         Blackburn Rovers               Everton      H      3
3         Bolton Wanderers                Fulham      D      4
4               Sunderland       Birmingham City      D      5
5           Wigan Athletic             Blackpool      A      6
6  Wolverhampton Wanderers            Stoke City      H      7
7                  Chelsea  West Bromwich Albion      H      8

In [34]:
premier['count'].isnull().sum()

0

In [72]:
Detail = premier_all['result'].replace({'H' : 'Home Win', 'A' : 'Away Win', 'D' : 'Draw'})
Detail

0           Draw
1       Home Win
2       Home Win
3           Draw
4           Draw
          ...
3663    Home Win
3664        Draw
3665    Away Win
3666        Draw
3667        Draw
Name: result, Length: 3668, dtype: object

In [73]:
premier.insert(premier.columns.get_loc('count') + 1, "Detail", Detail)

In [63]:
premier.head(8)

                 home_team             away_team result  count    Detail
0        Tottenham Hotspur       Manchester City      D      1      Draw
1              Aston Villa       West Ham United      H      2  Home Win
2         Blackburn Rovers               Everton      H      3  Home Win
3         Bolton Wanderers                Fulham      D      4      Draw
4               Sunderland       Birmingham City      D      5      Draw
5           Wigan Athletic             Blackpool      A      6  Away Win
6  Wolverhampton Wanderers            Stoke City      H      7  Home Win
7                  Chelsea  West Bromwich Albion      H      8  Home Win

In [41]:
premier.columns.get_loc('count')

3

In [42]:
premier.loc[11, 'Detail']

'Home Win'

In [43]:
premier.loc[11, 'Detail'] = np.nan

In [44]:
premier.loc[11, 'Detail']

nan

In [45]:
premier['Detail'].isnull().sum()

1

In [46]:
premier.columns

Index(['home_team', 'away_team', 'result', 'count', 'Detail'], dtype='object')

In [47]:
p_series = premier['Detail']
p_series.head()

0        Draw
1    Home Win
2    Home Win
3        Draw
4        Draw
Name: Detail, dtype: object

In [51]:
# Detail열 삭제
premier.drop('Detail', axis=1).head()

           home_team        away_team result  count
0  Tottenham Hotspur  Manchester City      D      1
1        Aston Villa  West Ham United      H      2
2   Blackburn Rovers          Everton      H      3
3   Bolton Wanderers           Fulham      D      4
4         Sunderland  Birmingham City      D      5

In [52]:
# 0번행 삭제
premier.drop(0, axis=0).head()

          home_team        away_team result  count    Detail
1       Aston Villa  West Ham United      H      2  Home Win
2  Blackburn Rovers          Everton      H      3  Home Win
3  Bolton Wanderers           Fulham      D      4      Draw
4        Sunderland  Birmingham City      D      5      Draw
5    Wigan Athletic        Blackpool      A      6  Away Win

In [53]:
# 열 삭제(리스트로 지정)
premier.drop(['result','count','Detail'], axis=1).head()

           home_team        away_team
0  Tottenham Hotspur  Manchester City
1        Aston Villa  West Ham United
2   Blackburn Rovers          Everton
3   Bolton Wanderers           Fulham
4         Sunderland  Birmingham City

In [54]:
# 행 삭제(리스트로 지정)
premier.drop([0,1,2], axis=0).head()

                 home_team             away_team result  count    Detail
3         Bolton Wanderers                Fulham      D      4      Draw
4               Sunderland       Birmingham City      D      5      Draw
5           Wigan Athletic             Blackpool      A      6  Away Win
6  Wolverhampton Wanderers            Stoke City      H      7  Home Win
7                  Chelsea  West Bromwich Albion      H      8  Home Win

In [74]:
premier.drop(['result','count','Detail'], axis=1)
premier.head()

           home_team        away_team result  count    Detail
0  Tottenham Hotspur  Manchester City      D      1      Draw
1        Aston Villa  West Ham United      H      2  Home Win
2   Blackburn Rovers          Everton      H      3  Home Win
3   Bolton Wanderers           Fulham      D      4      Draw
4         Sunderland  Birmingham City      D      5      Draw

In [75]:
premier.drop(['result','count','Detail'], axis=1, inplace=True)
premier.head()

           home_team        away_team
0  Tottenham Hotspur  Manchester City
1        Aston Villa  West Ham United
2   Blackburn Rovers          Everton
3   Bolton Wanderers           Fulham
4         Sunderland  Birmingham City

In [78]:
df = pd.read_csv('../Pandas/validation.csv')
df.head()

               home_team          away_team
0                Chelsea            Arsenal
1       AFC Bournemouth        Cardiff City
2                Fulham      Crystal Palace
3  Huddersfield Town AFC            Chelsea
4      Newcastle United   Tottenham Hotspur

In [77]:
home = df['home_team']
home

0                      Chelsea
1             AFC Bournemouth
2                      Fulham
3        Huddersfield Town AFC
4            Newcastle United
5                     Watford
6      Wolverhampton Wanderers
7                      Arsenal
8                    Liverpool
9                  Southampton
10                Cardiff City
11          Manchester United
12                     Everton
13              Leicester City
14          Tottenham Hotspur
15            West Ham United
16    Brighton and Hove Albion
17                     Burnley
18            Manchester City
Name: home_team, dtype: object

In [79]:
# 문자 길이 확인
home.str.len()

0      7
1     16
2      7
3     21
4     17
5      8
6     23
7      7
8      9
9     11
10    12
11    18
12     7
13    14
14    18
15    16
16    24
17     7
18    16
Name: home_team, dtype: int64

In [80]:
# 문자열 확인(True = 0, False = -1)
home.str.find('Manchester')

0    -1
1    -1
2    -1
3    -1
4    -1
5    -1
6    -1
7    -1
8    -1
9    -1
10   -1
11    0
12   -1
13   -1
14   -1
15   -1
16   -1
17   -1
18    0
Name: home_team, dtype: int64

In [81]:
# 문자 발생 횟수 확인
home.str.count('City')

0     0
1     0
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    1
11    0
12    0
13    1
14    0
15    0
16    0
17    0
18    1
Name: home_team, dtype: int64

In [85]:
st = pd.Index([' One ', ' Two ', ' Three '])
st

Index([' One ', ' Two ', ' Three '], dtype='object')

In [86]:
# 문자 공백 제거
st.str.strip()

Index(['One', 'Two', 'Three'], dtype='object')

In [87]:
# 문자 왼쪽 공백 제거
st.str.lstrip()

Index(['One ', 'Two ', 'Three '], dtype='object')

In [88]:
# 문자 오른쪽 공백 제거
st.str.rstrip()

Index([' One', ' Two', ' Three'], dtype='object')

In [91]:
series = pd.Series(['a;b;c', 'd;e;f', 'g;h;i'])
series

0    a;b;c
1    d;e;f
2    g;h;i
dtype: object

In [92]:
series.str.split(';')

0    [a, b, c]
1    [d, e, f]
2    [g, h, i]
dtype: object

In [97]:
series.str.split(';').str[1]

0    b
1    e
2    h
dtype: object

In [98]:
series.str.split(';', expand=True)

   0  1  2
0  a  b  c
1  d  e  f
2  g  h  i

In [106]:
series.str.split(';', expand=True, n=1)

   0    1
0  a  b;c
1  d  e;f
2  g  h;i

In [109]:
series.str.rsplit(';', expand=True, n=1)

     0  1
0  a;b  c
1  d;e  f
2  g;h  i

In [110]:
series.str.replace(';', '!')

0    a!b!c
1    d!e!f
2    g!h!i
dtype: object

In [111]:
series.str.cat()

'a;b;cd;e;fg;h;i'

In [112]:
series.str.cat(sep='!')

'a;b;c!d;e;f!g;h;i'

In [114]:
series.str.cat(['1','2','3'])

0    a;b;c1
1    d;e;f2
2    g;h;i3
dtype: object

In [115]:
series.str.cat(['1','2','3','4'])

ValueError: All arrays must be same length, except those having an index if `join` is not None